Revit 2027 API
BuiltInFailures.StairRampFailures.UnableToCreateMultistoryStairs Property
 Unable to create Multistory stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToCreateMultistoryStairs { get; }
Public Shared ReadOnly Property UnableToCreateMultistoryStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToCreateMultistoryStairs {
	FailureDefinitionId^ get ();
}
static member UnableToCreateMultistoryStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace